---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.ContainedInOtherLoops
source: html/16c7c5ca-8ac8-f4fd-8aec-844bb23c647a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.ContainedInOtherLoops Property

When creating an opening, you cannot sketch loops within other loops. The highlighted loop(s) are contained within another loop.

## Syntax (C#)
```csharp
public static FailureDefinitionId ContainedInOtherLoops { get; }
```